//onclick — ეს არის მოვლენა (event), რომელიც ხდება მაშინ, როცა მომხმარებელი რაღაცაზე კლიკს აკეთებს, მაგალითად ღილაკზე.

// როცა onclick ხდება, შეგვიძლია ვუთხრათ ბრაუზერს, რა ქნას — მაგალითად, გამოიტანოს ტექსტი.

// console.log — ეს არის ბრძანება, რომელიც ტექსტს ან მონაცემებს გამოჰყავს სპეციალურ ფანჯარაში

//ცვლადი არის სახელით მონიშნული ადგილი სადაც შეგიძლია შეინახო ინფორმაცია და მერე გამოიყენო ან შეცვალო.

  
  let a = 5;
  let b = 10;

  
  let sum = a + b;

  
  alert("ორი რიცხვის ჯამი: " + sum);



  let greeting = "გამარჯობა, მსოფლიო!";


console.log(greeting);