#List არის ელემენტების რიგრიგი კოლექცია, სადაც ელემენტები შეიძლება განმეორდეს და აქვთ ინდექსი.
#Set არის უნიკალური ელემენტების კოლექცია, ელემენტები არ მეორდება


fruits = {"apple", "banana"}

fruits.add("orange")

fruits.remove("banana")

diff = fruits.difference({"orange"})
print(fruits) 
print(diff)    


family = {
    "მამა": {
        "ასაკი": 45,
        "პროფესია": "ინჟინერი",
        "ქალაქი": "თბილისი"
    },
    "დედა": {
        "ასაკი": 42,
        "პროფესია": "მასწავლებელი",
        "ქალაქი": "თბილისი"
    },
    "ძმა": {
        "ასაკი": 20,
        "პროფესია": "სტუდენტი",
        "ქალაქი": "თბილისი"
    },
    "სხვა": {
        "ასაკი": 18,
        "პროფესია": "სტუდენტი",
        "ქალაქი": "ბათუმი"
    }
}

print(family["მამა"]["პროფესია"])  


family = {
    "მამა": {"ასაკი": 45, "პროფესია": "ინჟინერი"},
    "დედა": {"ასაკი": 42, "პროფესია": "მასწავლებელი"}
}


family["მამა"].update({"ჰობი": "ხატვა"})
family["დედა"].update({"ჰობი": "საზღვაო სეირნობა"})


family.update({"ძმა": {"ასაკი": 20, "პროფესია": "სტუდენტი"}})

print(family)